

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DELAY_H
#define __DELAY_H 	

/* Includes ------------------------------------------------------------------*/
#include "sys.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported define -----------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void delay_init(void);
void delay_ms(u16 nms);
void delay_us(u32 nus);

/* External variables --------------------------------------------------------*/

#endif

/************************ (C) COPYRIGHT ºÚ°ïÀÏ´ó *****END OF FILE***************/





























